busy-app/busybar-firmware/lib/simplicity_sdk_new/devices/platform/Device/SiliconLabs/EFR32FG2D/Include/efr32fg2d_smu.h
/* Bit fields for SMU PPUNSFS */
#define _SMU_PPUNSFS_RESETVALUE                    0x00000000UL                              /**< Default value for SMU_PPUNSFS               */
#define _SMU_PPUNSFS_MASK                          0x000000FFUL                              /**< Mask for SMU_PPUNSFS                        */
#define _SMU_PPUNSFS_PPUFSPERIPHID_SHIFT           0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUNSFS_PPUFSPERIPHID_MASK            0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSFS                */
#define SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT          (_SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_PPUNSFS        */

/* Bit fields for SMU BMPUNSPATD0 */
#define _SMU_BMPUNSPATD0_RESETVALUE                0x0000003FUL                                   /**< Default value for SMU_BMPUNSPATD0           */
#define _SMU_BMPUNSPATD0_MASK                      0x0000003FUL                                   /**< Mask for SMU_BMPUNSPATD0                    */
#define SMU_BMPUNSPATD0_RADIOAES                   (0x1UL << 0)                                   /**< RADIOAES Privileged Mode                    */
#define _SMU_BMPUNSPATD0_RADIOAES_SHIFT            0                                              /**< Shift value for SMU_RADIOAES                */
#define _SMU_BMPUNSPATD0_RADIOAES_MASK             0x1UL                                          /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_BMPUNSPATD0_RADIOAES_DEFAULT          0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOAES_DEFAULT           (_SMU_BMPUNSPATD0_RADIOAES_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM             (0x1UL << 1)                                   /**< RADIOSUBSYSTEM Privileged Mode              */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_SHIFT      1                                              /**< Shift value for SMU_RADIOSUBSYSTEM          */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_MASK       0x2UL                                          /**< Bit mask for SMU_RADIOSUBSYSTEM             */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT    0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT     (_SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT << 1) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_LDMA                       (0x1UL << 2)                                   /**< LDMA Privileged Mode                        */
#define _SMU_BMPUNSPATD0_LDMA_SHIFT                2                                              /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUNSPATD0_LDMA_MASK                 0x4UL                                          /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUNSPATD0_LDMA_DEFAULT              0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA_DEFAULT               (_SMU_BMPUNSPATD0_LDMA_DEFAULT << 2)           /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RFECA0                     (0x1UL << 3)                                   /**< RFECA0 Privileged Mode                      */
#define _SMU_BMPUNSPATD0_RFECA0_SHIFT              3                                              /**< Shift value for SMU_RFECA0                  */
#define _SMU_BMPUNSPATD0_RFECA0_MASK               0x8UL                                          /**< Bit mask for SMU_RFECA0                     */
#define _SMU_BMPUNSPATD0_RFECA0_DEFAULT            0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RFECA0_DEFAULT             (_SMU_BMPUNSPATD0_RFECA0_DEFAULT << 3)         /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RFECA1                     (0x1UL << 4)                                   /**< RFECA1 Privileged Mode                      */
#define _SMU_BMPUNSPATD0_RFECA1_SHIFT              4                                              /**< Shift value for SMU_RFECA1                  */
#define _SMU_BMPUNSPATD0_RFECA1_MASK               0x10UL                                         /**< Bit mask for SMU_RFECA1                     */
#define _SMU_BMPUNSPATD0_RFECA1_DEFAULT            0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RFECA1_DEFAULT             (_SMU_BMPUNSPATD0_RFECA1_DEFAULT << 4)         /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_SEEXTDMA                   (0x1UL << 5)                                   /**< SEEXTDMA Privileged Mode                    */
#define _SMU_BMPUNSPATD0_SEEXTDMA_SHIFT            5                                              /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUNSPATD0_SEEXTDMA_MASK             0x20UL                                         /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT          0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT           (_SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT << 5)       /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */

/** @} End of group EFR32FG2D_SMU_CFGNS_BitFields */
/** @} End of group EFR32FG2D_SMU_CFGNS */
/** @} End of group Parts */

#endif // EFR32FG2D_SMU_H
